Repository: wp-plugins/random-posts-from-category
Catalog: languages/random-posts-from-category.1.15-*.po
Languages: ro_ro

source: random posts from a chosen category
ro_ro: Random posts dintr-o categorie ales

source: Random Posts from Category
ro_ro: Random posturi de la categoria

source: Title:
ro_ro: Titlu:

source: Show posts from category:
ro_ro: Arată de posturi de la categoria:

source: Link widget title to category archive
ro_ro: Link-ul widget titlul categorie Arhiva

source: Number of posts to show:
ro_ro: Numărul de posturi pentru a arăta:

source: Display:
ro_ro: Afişare:

source: Title Only
ro_ro: Titlul numai

source: Title and Excerpt
ro_ro: Titlul şi extras

source: Title and Content
ro_ro: Titlul şi conţinutul

source: Limit excerpts to how many words?:
ro_ro: Limita fragmente de cât de multe cuvinte?:

source: Allowed HTML tags in excerpts:
ro_ro: Tag-uri HTML a permis în fragmente:

source: E.g.:
ro_ro: Exemplu:
